Revit 2027 API
BuiltInFailures.RebarFailures.ChangeUnitsFormatWarn Property
 The modification of the unit will cause the change of the Reinforcement rounding format. Do you want to continue?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ChangeUnitsFormatWarn { get; }
Public Shared ReadOnly Property ChangeUnitsFormatWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ChangeUnitsFormatWarn {
	FailureDefinitionId^ get ();
}
static member ChangeUnitsFormatWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace